app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "micropost with pictere"], ["picture", "rails.png"], ["user_id", 1], ["created_at", "2015-08-05 06:33:58.933802"], ["updated_at", "2015-08-05 06:33:58.933802"]]
---
	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save