app/controllers/password_resets_controller.rb

  def update
  	if params[:user][:password].empty?
  		flash.now[:danger] = "Password cannot be empty"
  		#redirect_to @user
  		render 'edit'
  	elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$cCyBzUzfsSUm2Yf00iY/i.2hmWxEfP64EgScZXJy77dR4BWLSM.Ge"], ["updated_at", "2015-07-31 12:25:59.709055"], ["id", 1]]